espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_flash.h
/******************************************************************************
*  Filename:       hw_flash_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_FLASH_H__
#define __HW_FLASH_H__

//*****************************************************************************
//
// This section defines the register offsets of
// FLASH component
//
//*****************************************************************************
// Internal
#define FLASH_O_WEPROT_B0_31_0_BY1                                  0x00000000

// Internal
#define FLASH_O_WEPROT_AUX_BY1                                      0x00000004

// NW and Efuse Status
#define FLASH_O_STAT                                                0x0000001C

// Internal
#define FLASH_O_CFG                                                 0x00000024

// Internal
#define FLASH_O_FLASH_SIZE                                          0x0000002C

// Internal
#define FLASH_O_FWLOCK                                              0x0000003C

// Internal
#define FLASH_O_FWFLAG                                              0x00000040

// Internal
#define FLASH_O_BANK0_TRIM_CFG_3                                    0x00000050

// Internal
#define FLASH_O_BANK0_TRIM_CFG_2                                    0x00000054

// Internal
#define FLASH_O_BANK0_TRIM_CFG_1                                    0x00000058

// Internal
#define FLASH_O_BANK0_TRIM_CFG_0                                    0x0000005C

// Internal
#define FLASH_O_BANK1_TRIM_CFG_3                                    0x00000060

// Internal
#define FLASH_O_BANK1_TRIM_CFG_2                                    0x00000064

// Internal
#define FLASH_O_BANK1_TRIM_CFG_1                                    0x00000068

// Internal
#define FLASH_O_BANK1_TRIM_CFG_0                                    0x0000006C

// Internal
#define FLASH_O_PUMP_TRIM_CFG_2                                     0x00000070

// Internal
#define FLASH_O_PUMP_TRIM_CFG_1                                     0x00000074

// Internal
#define FLASH_O_PUMP_TRIM_CFG_0                                     0x00000078

// Internal
#define FLASH_O_EFUSE                                               0x00001000

// Internal
#define FLASH_O_EFUSEADDR                                           0x00001004

// Internal
#define FLASH_O_DATAUPPER                                           0x00001008

// Internal
#define FLASH_O_DATALOWER                                           0x0000100C

// Internal
#define FLASH_O_EFUSECFG                                            0x00001010

// Internal
#define FLASH_O_EFUSESTAT                                           0x00001014

// Internal
#define FLASH_O_ACC                                                 0x00001018

// Internal
#define FLASH_O_BOUNDARY                                            0x0000101C

// Internal
#define FLASH_O_EFUSEFLAG                                           0x00001020

// Internal
#define FLASH_O_EFUSEKEY                                            0x00001024

// Internal
#define FLASH_O_EFUSERELEASE                                        0x00001028

// Internal
#define FLASH_O_EFUSEPINS                                           0x0000102C

// Internal
#define FLASH_O_EFUSECRA                                            0x00001030

// Internal
#define FLASH_O_EFUSEREAD                                           0x00001034

// Internal
#define FLASH_O_EFUSEPROGRAM                                        0x00001038

// Internal
#define FLASH_O_EFUSEERROR                                          0x0000103C

// Internal
#define FLASH_O_SINGLEBIT                                           0x00001040

// Internal
#define FLASH_O_TWOBIT                                              0x00001044

// Internal
#define FLASH_O_SELFTESTCYC                                         0x00001048

// Internal
#define FLASH_O_SELFTESTSIGN                                        0x0000104C

//*****************************************************************************
//
// Register: FLASH_O_WEPROT_B0_31_0_BY1
//
//*****************************************************************************
// Field:  [31:0] WEPROT_B0_31_0_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_B0_31_0_BY1_WEPROT_B0_31_0_BY1_W                       32
#define FLASH_WEPROT_B0_31_0_BY1_WEPROT_B0_31_0_BY1_M               0xFFFFFFFF
#define FLASH_WEPROT_B0_31_0_BY1_WEPROT_B0_31_0_BY1_S                        0

//*****************************************************************************
//
// Register: FLASH_O_WEPROT_AUX_BY1
//
//*****************************************************************************
// Field:     [5] WEPROT_B1_ENGR_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_ENGR_BY1                     0x00000020
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_ENGR_BY1_BITN                         5
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_ENGR_BY1_M                   0x00000020
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_ENGR_BY1_S                            5

// Field:     [4] WEPROT_B0_ENGR_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_ENGR_BY1                     0x00000010
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_ENGR_BY1_BITN                         4
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_ENGR_BY1_M                   0x00000010
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_ENGR_BY1_S                            4

