espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_flash.h
// Field:     [3] WEPROT_B1_TRIM_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_TRIM_BY1                     0x00000008
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_TRIM_BY1_BITN                         3
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_TRIM_BY1_M                   0x00000008
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_TRIM_BY1_S                            3

// Field:     [2] WEPROT_B0_TRIM_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_TRIM_BY1                     0x00000004
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_TRIM_BY1_BITN                         2
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_TRIM_BY1_M                   0x00000004
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_TRIM_BY1_S                            2

// Field:     [1] WEPROT_B1_FCFG_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_FCFG_BY1                     0x00000002
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_FCFG_BY1_BITN                         1
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_FCFG_BY1_M                   0x00000002
#define FLASH_WEPROT_AUX_BY1_WEPROT_B1_FCFG_BY1_S                            1

// Field:     [0] WEPROT_B0_CCFG_BY1
//
// Internal. Only to be used through TI provided API.
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_CCFG_BY1                     0x00000001
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_CCFG_BY1_BITN                         0
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_CCFG_BY1_M                   0x00000001
#define FLASH_WEPROT_AUX_BY1_WEPROT_B0_CCFG_BY1_S                            0

//*****************************************************************************
//
// Register: FLASH_O_STAT
//
//*****************************************************************************
// Field:    [16] STALLSTAT
//
// An ocp1 or ocp3 read stall has occurred.
// 0 : No stall or stall acknowledged by writing a 1
// 1 : Stall condition occurred/occurring
//
// This is a read/write-clear status bit. It will reset to 0. It will be set
// when either an ocp1 or ocp3 read occurs to a bank that is presently
// undergoing a program or write operation.
//
// An ocp2 write of 1 to this bit will clear the bit. The ocp2 write will take
// highest priority in the event an ocp1/ocp3 read is occurring concurrently to
// the ocp2 write.
// Clearing the bit should be done only after the ongoing program/erase
// operation is complete indicating that both banks are free.
// If clearing occurs while the stall condition persists, the field may get set
// back to one.
#define FLASH_STAT_STALLSTAT                                        0x00010000
#define FLASH_STAT_STALLSTAT_BITN                                           16
#define FLASH_STAT_STALLSTAT_M                                      0x00010000
#define FLASH_STAT_STALLSTAT_S                                              16

// Field:    [15] EFUSE_BLANK
//
// Efuse scanning detected if fuse ROM is blank:
// 0 : Not blank
// 1 : Blank
#define FLASH_STAT_EFUSE_BLANK                                      0x00008000
#define FLASH_STAT_EFUSE_BLANK_BITN                                         15
#define FLASH_STAT_EFUSE_BLANK_M                                    0x00008000
#define FLASH_STAT_EFUSE_BLANK_S                                            15

// Field:    [14] EFUSE_TIMEOUT
//
// Efuse scanning resulted in timeout error.
// 0 : No Timeout error
// 1 : Timeout Error
#define FLASH_STAT_EFUSE_TIMEOUT                                    0x00004000
#define FLASH_STAT_EFUSE_TIMEOUT_BITN                                       14
#define FLASH_STAT_EFUSE_TIMEOUT_M                                  0x00004000
#define FLASH_STAT_EFUSE_TIMEOUT_S                                          14

// Field:    [13] SPRS_BYTE_NOT_OK
//
// Efuse scanning resulted in scan chain Sparse byte error.
// 0 : No Sparse error
// 1 : Sparse Error
#define FLASH_STAT_SPRS_BYTE_NOT_OK                                 0x00002000
#define FLASH_STAT_SPRS_BYTE_NOT_OK_BITN                                    13
#define FLASH_STAT_SPRS_BYTE_NOT_OK_M                               0x00002000
#define FLASH_STAT_SPRS_BYTE_NOT_OK_S                                       13

// Field:  [12:8] EFUSE_ERRCODE
//
// Same as EFUSEERROR.CODE
#define FLASH_STAT_EFUSE_ERRCODE_W                                           5
#define FLASH_STAT_EFUSE_ERRCODE_M                                  0x00001F00
#define FLASH_STAT_EFUSE_ERRCODE_S                                           8

// Field:   [5:4] BUSY
//
// NW FW_SMSTAT.CMD_IN_PROGRESS bit.
// This flag is valid immediately after the operation setting it
// 0 : Not busy
// 1 : Busy
//
// Bit 4 is for the busy state for Bank0 which is at logical address 0x0
// Bit 5 for Bank1.
#define FLASH_STAT_BUSY_W                                                    2
#define FLASH_STAT_BUSY_M                                           0x00000030
#define FLASH_STAT_BUSY_S                                                    4

// Field:     [3] READY1T
//
// 1T access readiness status indicator from NW. Comes later than 2T readiness.
// 1: FLASH banks are ready for 1T accesses
// 0: FLASH banks are not ready for 1T accesses
#define FLASH_STAT_READY1T                                          0x00000008
#define FLASH_STAT_READY1T_BITN                                              3
#define FLASH_STAT_READY1T_M                                        0x00000008
#define FLASH_STAT_READY1T_S                                                 3

// Field:     [2] READY2T
//
// 2T access readiness status indicator from NW
// 1: FLASH banks are ready for 2T accesses
// 0: FLASH banks are not ready for 2T accesses
#define FLASH_STAT_READY2T                                          0x00000004
#define FLASH_STAT_READY2T_BITN                                              2
#define FLASH_STAT_READY2T_M                                        0x00000004
#define FLASH_STAT_READY2T_S                                                 2

