espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_flash.h
// Field:   [1:0] POWER_MODE
//
// Power state of each of the 2 flash arbiter FSM instances in the flash
// sub-system. For Thor, these bits should mostly be in the same state since
// both banks are in the same power mode.
// 0 : Active
// 1 : Ready for Low power (The 2T readiness has gone low or the flash_off_req
// has been set=1, and flash_off_ack is ready to be asserted).
//
// Bit 0 is for the power state for Bank0 which is at logical address 0x0
// Bit 1 for Bank1
#define FLASH_STAT_POWER_MODE_W                                              2
#define FLASH_STAT_POWER_MODE_M                                     0x00000003
#define FLASH_STAT_POWER_MODE_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_CFG
//
//*****************************************************************************
// Field:    [30] DIS_FWTEST
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_DIS_FWTEST                                        0x40000000
#define FLASH_CFG_DIS_FWTEST_BITN                                           30
#define FLASH_CFG_DIS_FWTEST_M                                      0x40000000
#define FLASH_CFG_DIS_FWTEST_S                                              30

// Field:    [11] MAIN_STICKY_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_MAIN_STICKY_EN                                    0x00000800
#define FLASH_CFG_MAIN_STICKY_EN_BITN                                       11
#define FLASH_CFG_MAIN_STICKY_EN_M                                  0x00000800
#define FLASH_CFG_MAIN_STICKY_EN_S                                          11

// Field:    [10] CCFG_STICKY_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_CCFG_STICKY_EN                                    0x00000400
#define FLASH_CFG_CCFG_STICKY_EN_BITN                                       10
#define FLASH_CFG_CCFG_STICKY_EN_M                                  0x00000400
#define FLASH_CFG_CCFG_STICKY_EN_S                                          10

// Field:     [9] FCFG_STICKY_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_FCFG_STICKY_EN                                    0x00000200
#define FLASH_CFG_FCFG_STICKY_EN_BITN                                        9
#define FLASH_CFG_FCFG_STICKY_EN_M                                  0x00000200
#define FLASH_CFG_FCFG_STICKY_EN_S                                           9

// Field:     [8] ENGR_TRIM_STICKY_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_ENGR_TRIM_STICKY_EN                               0x00000100
#define FLASH_CFG_ENGR_TRIM_STICKY_EN_BITN                                   8
#define FLASH_CFG_ENGR_TRIM_STICKY_EN_M                             0x00000100
#define FLASH_CFG_ENGR_TRIM_STICKY_EN_S                                      8

// Field:     [5] DIS_EFUSECLK
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_DIS_EFUSECLK                                      0x00000020
#define FLASH_CFG_DIS_EFUSECLK_BITN                                          5
#define FLASH_CFG_DIS_EFUSECLK_M                                    0x00000020
#define FLASH_CFG_DIS_EFUSECLK_S                                             5

// Field:     [4] DIS_READACCESS
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_DIS_READACCESS                                    0x00000010
#define FLASH_CFG_DIS_READACCESS_BITN                                        4
#define FLASH_CFG_DIS_READACCESS_M                                  0x00000010
#define FLASH_CFG_DIS_READACCESS_S                                           4

// Field:     [0] BP_TRIMCFG_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_BP_TRIMCFG_EN                                     0x00000001
#define FLASH_CFG_BP_TRIMCFG_EN_BITN                                         0
#define FLASH_CFG_BP_TRIMCFG_EN_M                                   0x00000001
#define FLASH_CFG_BP_TRIMCFG_EN_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FLASH_SIZE
//
//*****************************************************************************
// Field:   [9:7] SECTORS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FLASH_SIZE_SECTORS_W                                           3
#define FLASH_FLASH_SIZE_SECTORS_M                                  0x00000380
#define FLASH_FLASH_SIZE_SECTORS_S                                           7

//*****************************************************************************
//
// Register: FLASH_O_FWLOCK
//
//*****************************************************************************
// Field:   [2:0] FWLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWLOCK_FWLOCK_W                                                3
#define FLASH_FWLOCK_FWLOCK_M                                       0x00000007
#define FLASH_FWLOCK_FWLOCK_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_FWFLAG
//
//*****************************************************************************
// Field:   [2:0] FWFLAG
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWFLAG_FWFLAG_W                                                3
#define FLASH_FWFLAG_FWFLAG_M                                       0x00000007
#define FLASH_FWFLAG_FWFLAG_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_BANK0_TRIM_CFG_3
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FLASH_O_BANK0_TRIM_CFG_2
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FLASH_O_BANK0_TRIM_CFG_1
//
//*****************************************************************************
// Field: [27:22] REDSWSELW3
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW3_W                                  6
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW3_M                         0x0FC00000
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW3_S                                 22

// Field: [21:16] REDSWSELW2
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW2_W                                  6
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW2_M                         0x003F0000
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW2_S                                 16

// Field: [15:10] REDSWSELW1
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW1_W                                  6
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW1_M                         0x0000FC00
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW1_S                                 10

// Field:   [9:4] REDSWSELW0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW0_W                                  6
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW0_M                         0x000003F0
#define FLASH_BANK0_TRIM_CFG_1_REDSWSELW0_S                                  4

// Field:     [3] REDSWENW3
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW3                            0x00000008
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW3_BITN                                3
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW3_M                          0x00000008
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW3_S                                   3

// Field:     [2] REDSWENW2
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW2                            0x00000004
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW2_BITN                                2
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW2_M                          0x00000004
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW2_S                                   2

// Field:     [1] REDSWENW1
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW1                            0x00000002
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW1_BITN                                1
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW1_M                          0x00000002
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW1_S                                   1

