espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_flash.h
// Field:     [0] REDSWENW0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW0                            0x00000001
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW0_BITN                                0
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW0_M                          0x00000001
#define FLASH_BANK0_TRIM_CFG_1_REDSWENW0_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_BANK0_TRIM_CFG_0
//
//*****************************************************************************
// Field:  [31:0] BANK0_TRIM_CFG_0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK0_TRIM_CFG_0_BANK0_TRIM_CFG_0_W                           32
#define FLASH_BANK0_TRIM_CFG_0_BANK0_TRIM_CFG_0_M                   0xFFFFFFFF
#define FLASH_BANK0_TRIM_CFG_0_BANK0_TRIM_CFG_0_S                            0

//*****************************************************************************
//
// Register: FLASH_O_BANK1_TRIM_CFG_3
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FLASH_O_BANK1_TRIM_CFG_2
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FLASH_O_BANK1_TRIM_CFG_1
//
//*****************************************************************************
// Field: [27:22] REDSWSELW3
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW3_W                                  6
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW3_M                         0x0FC00000
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW3_S                                 22

// Field: [21:16] REDSWSELW2
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW2_W                                  6
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW2_M                         0x003F0000
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW2_S                                 16

// Field: [15:10] REDSWSELW1
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW1_W                                  6
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW1_M                         0x0000FC00
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW1_S                                 10

// Field:   [9:4] REDSWSELW0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW0_W                                  6
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW0_M                         0x000003F0
#define FLASH_BANK1_TRIM_CFG_1_REDSWSELW0_S                                  4

// Field:     [3] REDSWENW3
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW3                            0x00000008
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW3_BITN                                3
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW3_M                          0x00000008
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW3_S                                   3

// Field:     [2] REDSWENW2
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW2                            0x00000004
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW2_BITN                                2
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW2_M                          0x00000004
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW2_S                                   2

// Field:     [1] REDSWENW1
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW1                            0x00000002
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW1_BITN                                1
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW1_M                          0x00000002
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW1_S                                   1

// Field:     [0] REDSWENW0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW0                            0x00000001
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW0_BITN                                0
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW0_M                          0x00000001
#define FLASH_BANK1_TRIM_CFG_1_REDSWENW0_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_BANK1_TRIM_CFG_0
//
//*****************************************************************************
// Field:  [31:0] BANK1_TRIM_CFG_0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BANK1_TRIM_CFG_0_BANK1_TRIM_CFG_0_W                           32
#define FLASH_BANK1_TRIM_CFG_0_BANK1_TRIM_CFG_0_M                   0xFFFFFFFF
#define FLASH_BANK1_TRIM_CFG_0_BANK1_TRIM_CFG_0_S                            0

//*****************************************************************************
//
// Register: FLASH_O_PUMP_TRIM_CFG_2
//
//*****************************************************************************
// Field: [25:20] VWLCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_2_VWLCT_W                                        6
#define FLASH_PUMP_TRIM_CFG_2_VWLCT_M                               0x03F00000
#define FLASH_PUMP_TRIM_CFG_2_VWLCT_S                                       20

// Field: [19:14] VSLCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_2_VSLCT_W                                        6
#define FLASH_PUMP_TRIM_CFG_2_VSLCT_M                               0x000FC000
#define FLASH_PUMP_TRIM_CFG_2_VSLCT_S                                       14

// Field:  [13:9] VREADCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_2_VREADCT_W                                      5
#define FLASH_PUMP_TRIM_CFG_2_VREADCT_M                             0x00003E00
#define FLASH_PUMP_TRIM_CFG_2_VREADCT_S                                      9

// Field:   [8:4] VINLOWCCORCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_2_VINLOWCCORCT_W                                 5
#define FLASH_PUMP_TRIM_CFG_2_VINLOWCCORCT_M                        0x000001F0
#define FLASH_PUMP_TRIM_CFG_2_VINLOWCCORCT_S                                 4

// Field:   [3:0] VINHICCORCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_2_VINHICCORCT_W                                  4
#define FLASH_PUMP_TRIM_CFG_2_VINHICCORCT_M                         0x0000000F
#define FLASH_PUMP_TRIM_CFG_2_VINHICCORCT_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_PUMP_TRIM_CFG_1
//
//*****************************************************************************
// Field:    [31] VINHICCORCTLSB
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_VINHICCORCTLSB                        0x80000000
#define FLASH_PUMP_TRIM_CFG_1_VINHICCORCTLSB_BITN                           31
#define FLASH_PUMP_TRIM_CFG_1_VINHICCORCTLSB_M                      0x80000000
#define FLASH_PUMP_TRIM_CFG_1_VINHICCORCTLSB_S                              31

// Field: [30:25] VINHCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_VINHCT_W                                       6
#define FLASH_PUMP_TRIM_CFG_1_VINHCT_M                              0x7E000000
#define FLASH_PUMP_TRIM_CFG_1_VINHCT_S                                      25

// Field: [24:20] VCGCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_VCGCT_W                                        5
#define FLASH_PUMP_TRIM_CFG_1_VCGCT_M                               0x01F00000
#define FLASH_PUMP_TRIM_CFG_1_VCGCT_S                                       20

// Field: [19:15] IREFVRDCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_IREFVRDCT_W                                    5
#define FLASH_PUMP_TRIM_CFG_1_IREFVRDCT_M                           0x000F8000
#define FLASH_PUMP_TRIM_CFG_1_IREFVRDCT_S                                   15

