espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_flash.h
// Field: [14:10] IREFTCCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_IREFTCCT_W                                     5
#define FLASH_PUMP_TRIM_CFG_1_IREFTCCT_M                            0x00007C00
#define FLASH_PUMP_TRIM_CFG_1_IREFTCCT_S                                    10

// Field:   [9:6] IREFCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_IREFCT_W                                       4
#define FLASH_PUMP_TRIM_CFG_1_IREFCT_M                              0x000003C0
#define FLASH_PUMP_TRIM_CFG_1_IREFCT_S                                       6

// Field:   [5:0] FOSCCT
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_1_FOSCCT_W                                       6
#define FLASH_PUMP_TRIM_CFG_1_FOSCCT_M                              0x0000003F
#define FLASH_PUMP_TRIM_CFG_1_FOSCCT_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_PUMP_TRIM_CFG_0
//
//*****************************************************************************
// Field: [29:20] VHVCT_PV
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_PV_W                                    10
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_PV_M                            0x3FF00000
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_PV_S                                    20

// Field: [19:10] VHVCT_PGM
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_PGM_W                                   10
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_PGM_M                           0x000FFC00
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_PGM_S                                   10

// Field:   [9:0] VHVCT_ERS
//
// Internal. Only to be used through TI provided API.
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_ERS_W                                   10
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_ERS_M                           0x000003FF
#define FLASH_PUMP_TRIM_CFG_0_VHVCT_ERS_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_EFUSE
//
//*****************************************************************************
// Field: [28:24] INSTRUCTION
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSE_INSTRUCTION_W                                            5
#define FLASH_EFUSE_INSTRUCTION_M                                   0x1F000000
#define FLASH_EFUSE_INSTRUCTION_S                                           24

// Field:  [15:0] DUMPWORD
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSE_DUMPWORD_W                                              16
#define FLASH_EFUSE_DUMPWORD_M                                      0x0000FFFF
#define FLASH_EFUSE_DUMPWORD_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEADDR
//
//*****************************************************************************
// Field: [15:11] BLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEADDR_BLOCK_W                                              5
#define FLASH_EFUSEADDR_BLOCK_M                                     0x0000F800
#define FLASH_EFUSEADDR_BLOCK_S                                             11

// Field:  [10:0] ROW
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEADDR_ROW_W                                               11
#define FLASH_EFUSEADDR_ROW_M                                       0x000007FF
#define FLASH_EFUSEADDR_ROW_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_DATAUPPER
//
//*****************************************************************************
// Field:   [7:3] SPARE
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_SPARE_W                                              5
#define FLASH_DATAUPPER_SPARE_M                                     0x000000F8
#define FLASH_DATAUPPER_SPARE_S                                              3

// Field:     [2] P
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_P                                           0x00000004
#define FLASH_DATAUPPER_P_BITN                                               2
#define FLASH_DATAUPPER_P_M                                         0x00000004
#define FLASH_DATAUPPER_P_S                                                  2

// Field:     [1] R
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_R                                           0x00000002
#define FLASH_DATAUPPER_R_BITN                                               1
#define FLASH_DATAUPPER_R_M                                         0x00000002
#define FLASH_DATAUPPER_R_S                                                  1

// Field:     [0] EEN
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_EEN                                         0x00000001
#define FLASH_DATAUPPER_EEN_BITN                                             0
#define FLASH_DATAUPPER_EEN_M                                       0x00000001
#define FLASH_DATAUPPER_EEN_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_DATALOWER
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATALOWER_DATA_W                                              32
#define FLASH_DATALOWER_DATA_M                                      0xFFFFFFFF
#define FLASH_DATALOWER_DATA_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_EFUSECFG
//
//*****************************************************************************
// Field:     [8] IDLEGATING
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECFG_IDLEGATING                                   0x00000100
#define FLASH_EFUSECFG_IDLEGATING_BITN                                       8
#define FLASH_EFUSECFG_IDLEGATING_M                                 0x00000100
#define FLASH_EFUSECFG_IDLEGATING_S                                          8

// Field:   [4:3] SLAVEPOWER
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECFG_SLAVEPOWER_W                                          2
#define FLASH_EFUSECFG_SLAVEPOWER_M                                 0x00000018
#define FLASH_EFUSECFG_SLAVEPOWER_S                                          3

// Field:     [0] GATING
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECFG_GATING                                       0x00000001
#define FLASH_EFUSECFG_GATING_BITN                                           0
#define FLASH_EFUSECFG_GATING_M                                     0x00000001
#define FLASH_EFUSECFG_GATING_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_EFUSESTAT
//
//*****************************************************************************
// Field:     [0] RESETDONE
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSESTAT_RESETDONE                                   0x00000001
#define FLASH_EFUSESTAT_RESETDONE_BITN                                       0
#define FLASH_EFUSESTAT_RESETDONE_M                                 0x00000001
#define FLASH_EFUSESTAT_RESETDONE_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_ACC
//
//*****************************************************************************
// Field:  [23:0] ACCUMULATOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_ACC_ACCUMULATOR_W                                             24
#define FLASH_ACC_ACCUMULATOR_M                                     0x00FFFFFF
#define FLASH_ACC_ACCUMULATOR_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_BOUNDARY
//
//*****************************************************************************
// Field:    [23] DISROW0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BOUNDARY_DISROW0                                      0x00800000
#define FLASH_BOUNDARY_DISROW0_BITN                                         23
#define FLASH_BOUNDARY_DISROW0_M                                    0x00800000
#define FLASH_BOUNDARY_DISROW0_S                                            23

// Field:    [22] SPARE
//
// Internal. Only to be used through TI provided API.
#define FLASH_BOUNDARY_SPARE                                        0x00400000
#define FLASH_BOUNDARY_SPARE_BITN                                           22
#define FLASH_BOUNDARY_SPARE_M                                      0x00400000
#define FLASH_BOUNDARY_SPARE_S                                              22

