espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_flash.h
// Field:   [5:4] SYS_REPAIR_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_W                                      2
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_M                             0x00000030
#define FLASH_EFUSEPINS_SYS_REPAIR_EN_S                                      4

// Field:   [3:0] SYS_WS_READ_STATES
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_W                                 4
#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_M                        0x0000000F
#define FLASH_EFUSEPINS_SYS_WS_READ_STATES_S                                 0

//*****************************************************************************
//
// Register: FLASH_O_EFUSECRA
//
//*****************************************************************************
// Field:   [5:0] DATA
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECRA_DATA_W                                                6
#define FLASH_EFUSECRA_DATA_M                                       0x0000003F
#define FLASH_EFUSECRA_DATA_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEREAD
//
//*****************************************************************************
// Field:   [9:8] DATABIT
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEREAD_DATABIT_W                                            2
#define FLASH_EFUSEREAD_DATABIT_M                                   0x00000300
#define FLASH_EFUSEREAD_DATABIT_S                                            8

// Field:   [7:4] READCLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEREAD_READCLOCK_W                                          4
#define FLASH_EFUSEREAD_READCLOCK_M                                 0x000000F0
#define FLASH_EFUSEREAD_READCLOCK_S                                          4

// Field:     [3] DEBUG
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEREAD_DEBUG                                       0x00000008
#define FLASH_EFUSEREAD_DEBUG_BITN                                           3
#define FLASH_EFUSEREAD_DEBUG_M                                     0x00000008
#define FLASH_EFUSEREAD_DEBUG_S                                              3

// Field:     [2] SPARE
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEREAD_SPARE                                       0x00000004
#define FLASH_EFUSEREAD_SPARE_BITN                                           2
#define FLASH_EFUSEREAD_SPARE_M                                     0x00000004
#define FLASH_EFUSEREAD_SPARE_S                                              2

// Field:   [1:0] MARGIN
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEREAD_MARGIN_W                                             2
#define FLASH_EFUSEREAD_MARGIN_M                                    0x00000003
#define FLASH_EFUSEREAD_MARGIN_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEPROGRAM
//
//*****************************************************************************
// Field:    [30] COMPAREDISABLE
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE                           0x40000000
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE_BITN                              30
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE_M                         0x40000000
#define FLASH_EFUSEPROGRAM_COMPAREDISABLE_S                                 30

// Field: [29:14] CLOCKSTALL
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_W                                     16
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_M                             0x3FFFC000
#define FLASH_EFUSEPROGRAM_CLOCKSTALL_S                                     14

// Field:    [13] VPPTOVDD
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPROGRAM_VPPTOVDD                                 0x00002000
#define FLASH_EFUSEPROGRAM_VPPTOVDD_BITN                                    13
#define FLASH_EFUSEPROGRAM_VPPTOVDD_M                               0x00002000
#define FLASH_EFUSEPROGRAM_VPPTOVDD_S                                       13

// Field:  [12:9] ITERATIONS
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPROGRAM_ITERATIONS_W                                      4
#define FLASH_EFUSEPROGRAM_ITERATIONS_M                             0x00001E00
#define FLASH_EFUSEPROGRAM_ITERATIONS_S                                      9

// Field:   [8:0] WRITECLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEPROGRAM_WRITECLOCK_W                                      9
#define FLASH_EFUSEPROGRAM_WRITECLOCK_M                             0x000001FF
#define FLASH_EFUSEPROGRAM_WRITECLOCK_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEERROR
//
//*****************************************************************************
// Field:     [5] DONE
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEERROR_DONE                                       0x00000020
#define FLASH_EFUSEERROR_DONE_BITN                                           5
#define FLASH_EFUSEERROR_DONE_M                                     0x00000020
#define FLASH_EFUSEERROR_DONE_S                                              5

// Field:   [4:0] CODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEERROR_CODE_W                                              5
#define FLASH_EFUSEERROR_CODE_M                                     0x0000001F
#define FLASH_EFUSEERROR_CODE_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_SINGLEBIT
//
//*****************************************************************************
// Field:  [31:1] FROMN
//
// Internal. Only to be used through TI provided API.
#define FLASH_SINGLEBIT_FROMN_W                                             31
#define FLASH_SINGLEBIT_FROMN_M                                     0xFFFFFFFE
#define FLASH_SINGLEBIT_FROMN_S                                              1

// Field:     [0] FROM0
//
// Internal. Only to be used through TI provided API.
#define FLASH_SINGLEBIT_FROM0                                       0x00000001
#define FLASH_SINGLEBIT_FROM0_BITN                                           0
#define FLASH_SINGLEBIT_FROM0_M                                     0x00000001
#define FLASH_SINGLEBIT_FROM0_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_TWOBIT
//
//*****************************************************************************
// Field:  [31:1] FROMN
//
// Internal. Only to be used through TI provided API.
#define FLASH_TWOBIT_FROMN_W                                                31
#define FLASH_TWOBIT_FROMN_M                                        0xFFFFFFFE
#define FLASH_TWOBIT_FROMN_S                                                 1

// Field:     [0] FROM0
//
// Internal. Only to be used through TI provided API.
#define FLASH_TWOBIT_FROM0                                          0x00000001
#define FLASH_TWOBIT_FROM0_BITN                                              0
#define FLASH_TWOBIT_FROM0_M                                        0x00000001
#define FLASH_TWOBIT_FROM0_S                                                 0

//*****************************************************************************
//
// Register: FLASH_O_SELFTESTCYC
//
//*****************************************************************************
// Field:  [31:0] CYCLES
//
// Internal. Only to be used through TI provided API.
#define FLASH_SELFTESTCYC_CYCLES_W                                          32
#define FLASH_SELFTESTCYC_CYCLES_M                                  0xFFFFFFFF
#define FLASH_SELFTESTCYC_CYCLES_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_SELFTESTSIGN
//
//*****************************************************************************
// Field:  [31:0] SIGNATURE
//
// Internal. Only to be used through TI provided API.
#define FLASH_SELFTESTSIGN_SIGNATURE_W                                      32
#define FLASH_SELFTESTSIGN_SIGNATURE_M                              0xFFFFFFFF
#define FLASH_SELFTESTSIGN_SIGNATURE_S                                       0


#endif // __FLASH__
